---
type: KeyBasedTreeEntries
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# KeyBasedTreeEntries

`Autodesk.Revit.DB.KeyBasedTreeEntries` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | FindEntry | 2015 | `public KeyBasedTreeEntry FindEntry ( string key )` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < KeyBasedTreeEntry > GetEnumerator ()` |
| Method | GetKeyBasedTreeEntriesIterator | 2015 | `public KeyBasedTreeEntriesIterator GetKeyBasedTreeEntriesIterator ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |